import * as React from "react";

interface AdministrationProps extends React.SVGProps<SVGSVGElement> {
  className?: string;
  size?: number | string;
}

/**
 * @function Administration
 * @description Компонент для отображения иконки "Администрирование"
 * @param {ShowcaseProps} props - props для компонента
 * @returns {ReactElement} реакт-элемент иконки
 */

const Administration = React.forwardRef<SVGSVGElement, AdministrationProps>(
  ({className, size = 24, ...props}, ref) => {
    return (
      <svg
        xmlns="http://www.w3.org/2000/svg"
        width={size}
        height={size}
        viewBox="0 0 24 24"
        fill="currentColor"
        className={className}
        ref={ref}
        {...props}
      >
        <path
          fillRule="evenodd"
          clipRule="evenodd"
          d="M4.55404 4.20979C4.903 3.04659 5.97364 2.25 7.18806 2.25H16.8119C18.0264 2.24999 19.097 3.04658 19.446 4.20979L18.7276 4.4253L19.446 4.20979L21.381 10.6599C21.6257 11.4755 21.75 12.3226 21.75 13.1742V19C21.75 20.5188 20.5188 21.75 19 21.75H5C3.48122 21.75 2.25 20.5188 2.25 19V13.1741C2.25001 12.3226 2.37433 11.4755 2.61904 10.6599C2.61904 10.6599 2.61904 10.6599 2.61904 10.6599L4.55404 4.20979L4.55404 4.20979ZM5.99078 4.64081C5.99078 4.64081 5.99078 4.64081 5.99078 4.64081L4.05578 11.0909L4.05578 11.0909C4.03991 11.1438 4.02466 11.1968 4.01002 11.25H19.99C19.9754 11.1968 19.9601 11.1438 19.9442 11.0909L20.6626 10.8754L19.9442 11.0909L18.0092 4.64081C17.8506 4.11208 17.364 3.74999 16.8119 3.75H7.18806C6.63605 3.75 6.1494 4.11208 5.99078 4.64081ZM20.2376 12.75H3.76242C3.75415 12.8911 3.75 13.0326 3.75 13.1742V19C3.75 19.6904 4.30964 20.25 5 20.25H19C19.6904 20.25 20.25 19.6904 20.25 19V13.1741C20.25 13.0326 20.2459 12.8911 20.2376 12.75ZM7.75 6C7.75 5.58579 8.08579 5.25 8.5 5.25H15.5C15.9142 5.25 16.25 5.58579 16.25 6C16.25 6.41421 15.9142 6.75 15.5 6.75H8.5C8.08579 6.75 7.75 6.41421 7.75 6ZM6.75 9C6.75 8.58579 7.08579 8.25 7.5 8.25H16.5C16.9142 8.25 17.25 8.58579 17.25 9C17.25 9.41421 16.9142 9.75 16.5 9.75H7.5C7.08579 9.75 6.75 9.41421 6.75 9ZM9 14.25C9.41421 14.25 9.75 14.5858 9.75 15V16C9.75 16.1381 9.86193 16.25 10 16.25H14C14.1381 16.25 14.25 16.1381 14.25 16V15C14.25 14.5858 14.5858 14.25 15 14.25C15.4142 14.25 15.75 14.5858 15.75 15V16C15.75 16.9665 14.9665 17.75 14 17.75H10C9.0335 17.75 8.25 16.9665 8.25 16V15C8.25 14.5858 8.58579 14.25 9 14.25Z"
        />
      </svg>
    );
  }
);

Administration.displayName = "Administration";

export {Administration};