import * as React from "react";

interface ArchiveProps extends React.SVGProps<SVGSVGElement> {
  className?: string;
  size?: number | string;
}

/**
 * @function Archive
 * @description Компонент для отображения иконки "Архив]"
 * @param {ShowcaseProps} props - props для компонента
 * @returns {ReactElement} реакт-элемент иконки
 */

const Archive = React.forwardRef<SVGSVGElement, ArchiveProps>(
  ({className, size = 24, ...props}, ref) => {
    return (
      <svg
        xmlns="http://www.w3.org/2000/svg"
        width={size}
        height={size}
        viewBox="0 0 24 24"
        fill="currentColor"
        className={className}
        ref={ref}
        {...props}
      >
        <path
          fillRule="evenodd"
          clipRule="evenodd"
          d="M3.5625 3.75C3.25184 3.75 3 4.00184 3 4.3125V5.4375C3 5.74816 3.25184 6 3.5625 6H20.4375C20.7482 6 21 5.74816 21 5.4375V4.3125C21 4.00184 20.7482 3.75 20.4375 3.75H3.5625ZM1.5 4.3125C1.5 3.17341 2.42341 2.25 3.5625 2.25H20.4375C21.5766 2.25 22.5 3.17341 22.5 4.3125V5.4375C22.5 6.38158 21.8657 7.17751 21 7.42236V19.125L21 19.1272C20.9979 19.8222 20.7209 20.4881 20.2295 20.9795C19.7381 21.4709 19.0722 21.7479 18.3772 21.75L18.375 21.75H5.625L5.62276 21.75C4.9278 21.7479 4.2619 21.4709 3.77048 20.9795C3.27907 20.4881 3.00208 19.8222 3 19.1272L3 19.125V7.42236C2.13431 7.17751 1.5 6.38158 1.5 5.4375V4.3125ZM4.5 7.5V19.1237C4.50115 19.4221 4.62017 19.7079 4.83114 19.9189C5.04209 20.1298 5.32785 20.2488 5.62614 20.25H18.3739C18.6722 20.2488 18.9579 20.1298 19.1689 19.9189C19.3798 19.7079 19.4988 19.4222 19.5 19.1239V7.5H4.5ZM12 9.75C12.4142 9.75 12.75 10.0858 12.75 10.5V15.4393L14.4697 13.7197C14.7626 13.4268 15.2374 13.4268 15.5303 13.7197C15.8232 14.0126 15.8232 14.4874 15.5303 14.7803L12.5303 17.7803C12.2374 18.0732 11.7626 18.0732 11.4697 17.7803L8.46967 14.7803C8.17678 14.4874 8.17678 14.0126 8.46967 13.7197C8.76256 13.4268 9.23744 13.4268 9.53033 13.7197L11.25 15.4393V10.5C11.25 10.0858 11.5858 9.75 12 9.75Z"
        />
      </svg>
    );
  }
);

Archive.displayName = "Archive";

export {Archive};