import * as React from "react";

interface EditProps extends React.SVGProps<SVGSVGElement> {
  className?: string;
  size?: number | string;
}

/**
 * @function Edit
 * @description Компонент для отображения иконки "Изменить"
 * @param {ShowcaseProps} props - props для компонента
 * @returns {ReactElement} реакт-элемент иконки
 */

const Edit = React.forwardRef<SVGSVGElement, EditProps>(
  ({className, size = 24, ...props}, ref) => {
    return (
      <svg
        xmlns="http://www.w3.org/2000/svg"
        width={size}
        height={size}
        viewBox="0 0 24 24"
        fill="currentColor"
        className={className}
        ref={ref}
        {...props}
      >

        <path
          fillRule="evenodd"
          clipRule="evenodd"
          d="M16.5017 5.82332C16.4046 5.72621 16.2464 5.72621 16.1493 5.82332L14.8117 7.16099L16.8399 9.1892L18.1777 7.85166C18.1777 7.85164 18.1777 7.85162 18.1777 7.85161C18.2748 7.7545 18.2748 7.59641 18.1777 7.49932L16.5017 5.82332ZM17.3841 10.7662L19.2383 8.91237L19.2383 8.91232C19.9212 8.22943 19.9212 7.12155 19.2383 6.43866L17.5623 4.76266C16.8794 4.07976 15.7716 4.07976 15.0887 4.76266L13.2535 6.59782C13.242 6.60801 13.2307 6.61863 13.2197 6.62966C13.2086 6.64069 13.198 6.65197 13.1878 6.6635L4.76409 15.0872C4.76383 15.0875 4.76357 15.0878 4.7633 15.088C4.4335 15.4165 4.25 15.8619 4.25 16.325V19C4.25 19.4142 4.58579 19.75 5 19.75H7.675C8.13818 19.75 8.58359 19.5665 8.91206 19.2366C8.91229 19.2364 8.91252 19.2361 8.91274 19.2359L17.3561 10.7942C17.3609 10.7896 17.3656 10.785 17.3703 10.7803C17.375 10.7757 17.3796 10.771 17.3841 10.7662ZM15.7791 10.2498L13.751 8.22165L5.82333 16.1493L5.82191 16.1507C5.77621 16.1962 5.75 16.2585 5.75 16.325V18.25H7.675C7.7415 18.25 7.8038 18.2238 7.84926 18.1781L7.85072 18.1766L15.7791 10.2498Z"
        />
      </svg>
    );
  }
);

Edit.displayName = "Edit";

export {Edit};